Execution result of `run-all plan` in `infrastructure/cloud` :
```
time=2023-10-14T19:01:23Z level=info msg=The stack at /github/workspace/infrastructure/cloud will be processed in the following order for command plan:
Group 1
- Module /github/workspace/infrastructure/cloud/cloudflare/access
- Module /github/workspace/infrastructure/cloud/cloudflare/tunnel

Group 2
- Module /github/workspace/infrastructure/cloud/cloudflare/dns



Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file

Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.21.0...
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
cloudflare_tunnel.this: Refreshing state... [id=de250703-6c08-400d-b568-bc0aa34cabaf]
cloudflare_access_application.this: Refreshing state... [id=bcaa03ae-0a94-42ad-935c-487ca0a80723]

Changes to Outputs:
  + cname = (sensitive value)

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
data.github_ip_ranges.this: Reading...
data.github_ip_ranges.this: Read complete after 0s [id=github-ip-ranges]
cloudflare_access_policy.this: Refreshing state... [id=1b62d9cb-f555-4d23-b815-dfe3f92bd2a1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
data.cloudflare_zone.this: Reading...
data.cloudflare_zone.this: Read complete after 1s [id=58c3f6c213b1f1a8e7bbe57fc025c438]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.record will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive value)
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive value)
      + zone_id         = "58c3f6c213b1f1a8e7bbe57fc025c438"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
    